students = [
    ("Иван", "Петров", [4, 5, 5, 4], [3, 4, 5, 3], 0.9),
    ("Мария", "Иванова", [5, 5, 5, 5], [5, 5, 4, 5], 0.95),
    ("Алексей", "Сидоров", [3, 4, 3, 3], [4, 3, 4, 4], 0.7),
    ("Елена", "Козлова", [5, 4, 5, 5], [4, 5, 5, 5], 0.85),
    ("Дмитрий", "Смирнов", [2, 3, 2, 3], [3, 2, 2, 3], 0.5)
]
print("Студенты с низкой посещаймостью:")
for i in students:
    if i[4]<0.75:
        print(i[0], i[1])
print()

print("Лучшие студенты: ")
max = 0
for i in students:
    sr=round((sum(i[2])+sum(i[3]))/(len(i[2])+len(i[3])), 1)
    if sr > max:
        max = sr
        ind = i
print("Самый высокий средний балл:", ind[0], ind[1])
print()

for i in students:
    if sum(i[2])/len(i[2]) < sum(i[3])/len(i[3]):
        print(i[0], i[1], " нужно уделить больше времени Python")
print()